-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 29, 2025 at 12:51 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `laravel_task_3`
--

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `divisions`
--

CREATE TABLE `divisions` (
  `id` int(11) NOT NULL,
  `name_en` text DEFAULT NULL,
  `name_bn` text DEFAULT NULL,
  `priority` int(11) DEFAULT NULL,
  `created_by` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `divisions`
--

INSERT INTO `divisions` (`id`, `name_en`, `name_bn`, `priority`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 'Dhaka', 'ঢাকা', 1, 1, '2025-05-27 16:25:49', '2025-07-06 10:07:10'),
(2, 'Chattogram', 'চট্টগ্রাম', 2, 1, '2025-05-27 16:25:49', '2025-05-28 10:08:42'),
(3, 'Rajshahi', 'রাজশাহী', 0, 1, '2025-05-27 16:25:49', '2025-07-02 05:23:35'),
(4, 'Khulna', 'খুলনা', 0, 1, '2025-05-27 16:25:49', '2025-07-02 05:23:42'),
(5, 'Barishal', 'বরিশাল', 0, 1, '2025-05-27 16:25:49', '2025-07-02 05:23:47'),
(10, 'Sylhet', 'সিলেট', 0, 1, '2025-07-02 05:22:57', '2025-07-02 05:22:57'),
(11, 'Rangpur', 'রংপুর', 0, 1, '2025-07-02 05:23:26', '2025-07-02 05:23:26'),
(12, 'Mymensingh', 'ময়মনসিংহ', 0, 1, '2025-07-02 05:24:29', '2025-07-02 05:24:29');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `important_links`
--

CREATE TABLE `important_links` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `site_link` text DEFAULT NULL,
  `photo` text DEFAULT NULL,
  `priority` int(11) NOT NULL DEFAULT 1 COMMENT 'max are top',
  `link_type` varchar(50) DEFAULT 'LINKS' COMMENT 'LINKS, CONTACT',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `important_links`
--

INSERT INTO `important_links` (`id`, `title`, `site_link`, `photo`, `priority`, `link_type`, `created_at`, `updated_at`) VALUES
(1, 'গৃহায়ণ ও গণপূর্ত মন্ত্রণালয়', 'https://mohpw.gov.bd/', NULL, 11, 'LINKS', '2025-01-26 22:08:47', '2025-06-24 03:52:59'),
(2, 'গণপূর্ত অধিদপ্তর', 'https://pwd.gov.bd/', NULL, 10, 'LINKS', '2025-01-26 22:09:14', '2025-06-24 03:53:57'),
(3, 'স্থাপত্য অধিদপ্তর', 'https://architecture.gov.bd/', NULL, 9, 'LINKS', '2025-01-26 22:08:47', '2025-06-24 03:52:59'),
(4, '\r\nরাজধানী উন্নয়ন কর্তৃপক্ষ', 'https://rajuk.gov.bd/\n', NULL, 8, 'LINKS', '2025-01-26 22:09:14', '2025-06-24 03:53:57'),
(5, 'IDEB', 'https://ideb.org.bd/', NULL, 7, 'LINKS', '2025-01-26 22:08:47', '2025-06-24 03:52:59'),
(6, 'Helpline 333', 'https://rajuk.gov.bd/123', NULL, 6, 'CONTACT', '2025-01-26 22:08:47', '2025-06-29 22:52:45'),
(15, 'স্থাপত্য অধিদপ্তর', 'https://architecture.gov.bd/', 'backend_assets/images/links/68621f91bf760.jpg', 2, 'LINKS', '2025-06-29 23:24:33', '2025-06-29 23:24:33'),
(16, 'রাজধানী উন্নয়ন কর্তৃপক্ষ', 'https://www.facebook.com/', 'backend_assets/images/links/686254718aec7.jpg', 2, 'LINKS', '2025-06-30 03:10:09', '2025-06-30 03:10:09');

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `members`
--

CREATE TABLE `members` (
  `id` int(11) NOT NULL,
  `membership_number` varchar(250) DEFAULT NULL,
  `membership_date` varchar(10) NOT NULL DEFAULT '0000-00-00',
  `name` text NOT NULL,
  `father_name` text DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `email` text DEFAULT NULL,
  `proposed_informations` text DEFAULT NULL,
  `member_photo` text DEFAULT NULL,
  `otp_code` text DEFAULT NULL,
  `member_status` tinyint(1) NOT NULL DEFAULT 1 COMMENT '1 = active , 2 = inactive',
  `update_by` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `members`
--

INSERT INTO `members` (`id`, `membership_number`, `membership_date`, `name`, `father_name`, `phone`, `email`, `proposed_informations`, `member_photo`, `otp_code`, `member_status`, `update_by`, `created_at`, `updated_at`) VALUES
(1, '201', '2024-05-25', 'Nazmul', 'dsfg', '01567977617', NULL, NULL, 'backend_assets/images/dba_members/668f6e3048eae.jpg', NULL, 1, 0, '2024-07-10 23:31:28', '2024-07-10 23:31:28'),
(2, '202', '2022-04-17', 'Atikur Rahman', 'erty', '01920400829', NULL, NULL, 'backend_assets/images/dba_members/668f6e6137a8e.png', NULL, 1, 0, '2024-07-10 23:32:17', '2024-07-10 23:32:17');

-- --------------------------------------------------------

--
-- Table structure for table `member_requests`
--

CREATE TABLE `member_requests` (
  `id` int(11) NOT NULL,
  `membership_number` varchar(250) DEFAULT NULL,
  `name` text NOT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `email` text DEFAULT NULL,
  `member_photo` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `member_requests`
--

INSERT INTO `member_requests` (`id`, `membership_number`, `name`, `phone`, `email`, `member_photo`, `created_at`, `updated_at`) VALUES
(1, NULL, 'Nazmul', '01567977617', NULL, 'backend_assets/images/dba_members/668f6e3048eae.jpg', '2024-07-10 23:31:28', '2024-07-10 23:31:28'),
(2, NULL, 'Atikur Rahman', '01920400829', NULL, 'backend_assets/images/dba_members/668f6e6137a8e.png', '2024-07-10 23:32:17', '2024-07-10 23:32:17');

-- --------------------------------------------------------

--
-- Table structure for table `member_zones`
--

CREATE TABLE `member_zones` (
  `id` int(11) NOT NULL,
  `zone_name` text NOT NULL,
  `zilla_id` int(11) NOT NULL,
  `division_id` int(11) NOT NULL DEFAULT 0,
  `member_zone_type_id` int(11) NOT NULL DEFAULT 0,
  `created_by` int(11) DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `member_zones`
--

INSERT INTO `member_zones` (`id`, `zone_name`, `zilla_id`, `division_id`, `member_zone_type_id`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 'রংপুর গণপূর্ত জোন', 53, 11, 2, 1, '2025-06-24 11:54:41', '2025-07-06 08:13:55'),
(2, 'রংপুর গণপূর্ত সার্কেল', 53, 11, 4, 1, '2025-06-24 11:54:41', '2025-07-06 09:45:58'),
(3, 'রংপুর গণপূর্ত বিভাগ  ', 53, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(4, 'দিনাজপুর গণপূর্ত সার্কেল ', 57, 7, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(5, 'দিনাজপুর গণপূর্ত বিভাগ', 57, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(6, 'লালমনিরহাট গণপূর্ত বিভাগ', 54, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(7, 'ঠাকুরগাঁও গণপূর্ত বিভাগ', 58, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(8, 'কুড়িগ্রাম গণপূর্ত বিভাগ  2', 56, 11, 3, 1, '2025-06-24 11:54:41', '2025-07-06 09:44:16'),
(9, 'নীলফামারী গণপূর্ত বিভাগ', 60, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(10, 'পঞ্চগড় গণপূর্ত বিভাগ', 55, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(11, 'গাইবান্ধা গণপূর্ত বিভাগ', 59, 7, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(12, 'বরিশাল গণপূর্ত জোন', 47, 6, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(13, 'বরিশাল গণপূর্ত সার্কেল', 47, 6, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(14, 'বরিশাল গণপূর্ত বিভাগ', 47, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(15, 'ভোলা গণপূর্ত বিভাগ', 51, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(16, 'পটুয়াখালী গণপূর্ত বিভাগ', 49, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(17, 'বরগুনা গণপূর্ত বিভাগ', 52, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(18, 'পিরোজপুর গণপূর্ত বিভাগ', 50, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(19, 'ঝালকাঠি গণপূর্ত বিভাগ', 48, 6, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(20, 'খুলনা গণপূর্ত জোন', 37, 5, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(21, 'খুলনা গণপূর্ত সার্কেল', 37, 5, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(22, 'খুলনা গণপূর্ত বিভাগ - ১', 37, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(23, 'খুলনা গণপূর্ত বিভাগ - ২', 37, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(24, 'সাতক্ষীরা গণপূর্ত বিভাগ', 39, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(25, 'বাগেরহাট গণপূর্ত বিভাগ', 44, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(26, 'যশোর গণপূর্ত সার্কেল', 38, 5, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(27, 'যশোর গণপূর্ত বিভাগ', 38, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(29, 'ঝিনাইদহ গণপূর্ত বিভাগ', 45, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(30, 'মাগুরা গণপূর্ত বিভাগ', 43, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(31, 'চুয়াডাঙ্গা গণপূর্ত বিভাগ', 42, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(32, 'মেহেরপুর গণপূর্ত বিভাগ', 40, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(33, 'কুষ্টিয়া গণপূর্ত বিভাগ', 46, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(34, 'রাজশাহী গণপূর্ত জোন', 14, 2, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(35, 'রাজশাহী গণপূর্ত ই/এম পিএন্ডডি বিভাগ', 14, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(36, 'রাজশাহী গণপূর্ত সার্কেল', 14, 2, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(37, 'রাজশাহী গণপূর্ত বিভাগ - ১', 14, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(38, 'রাজশাহী গণপূর্ত বিভাগ - ২', 14, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(39, 'চাঁপাইনবাবগঞ্জ গণপূর্ত বিভাগ', 18, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(40, 'নওগাঁ গণপূর্ত বিভাগ', 20, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(41, 'পাবনা গণপূর্ত সার্কেল', 16, 2, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(42, 'পাবনা গণপূর্ত বিভাগ', 16, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(43, 'নাটোর গণপূর্ত বিভাগ ', 21, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(44, 'সিরাজগঞ্জ  গণপূর্ত বিভাগ', 15, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(45, 'বগুড়া গণপূর্ত সার্কেল', 17, 2, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(46, 'বগুড়া গণপূর্ত বিভাগ', 17, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(47, 'জয়পুরহাট গণপূর্ত বিভাগ', 19, 2, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(48, 'সিলেট গণপূর্ত জোন', 33, 4, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(49, 'সিলেট গণপূর্ত সার্কেল', 33, 4, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(50, 'সিলেট গণপূর্ত বিভাগ', 33, 4, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(51, 'সুনামগঞ্জ গণপূর্ত বিভাগ', 36, 4, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(52, 'মৌলভীবাজার গণপূর্ত বিভাগ', 34, 4, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(53, 'হবিগঞ্জ গণপূর্ত বিভাগ', 35, 4, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(54, 'চট্টগ্রাম গণপূর্ত জোন', 22, 3, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(55, 'চট্টগ্রাম গণপূর্ত সার্কেল - ১ ', 22, 3, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(56, 'চট্টগ্রাম গণপূর্ত বিভাগ - ১ ', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(57, 'চট্টগ্রাম গণপূর্ত বিভাগ - ২', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(58, 'চট্টগ্রাম গণপূর্ত সার্কেল - ২', 22, 3, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(59, 'চট্টগ্রাম গণপূর্ত বিভাগ - ৩', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(60, 'চট্টগ্রাম গণপূর্ত বিভাগ - ৪', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(61, 'চট্টগ্রাম গণপূর্ত ই/এম সার্কেল', 22, 3, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(62, 'চট্টগ্রাম গণপূর্ত ই/এম বিভাগ - ১', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(63, 'চট্টগ্রাম গণপূর্ত ই/এম বিভাগ - ২', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(64, 'চট্টগ্রাম গণপূর্ত ই/এম পিএন্ডডি বিভাগ', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(65, 'কক্সবাজার গণপূর্ত বিভাগ', 30, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(66, 'রাঙ্গামাটি গণপূর্ত সার্কেল ', 26, 3, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(67, 'খাগড়াছড়ি গণপূর্ত বিভাগ', 31, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(68, 'বান্দরবান গণপূর্ত বিভাগ', 32, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(69, 'কুমিল্লা গণপূর্ত সার্কেল', 23, 3, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(70, 'কুমিল্লা গণপূর্ত বিভাগ', 23, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(71, 'ব্রাহ্মণবাড়িয়া গণপূর্ত বিভাগ', 25, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(72, 'চাঁদপুর গণপূর্ত বিভাগ', 27, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(73, 'নোয়াখালী গণপূর্ত বিভাগ', 28, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(74, 'ফেনী গণপূর্ত বিভাগ', 24, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(75, 'লক্ষীপুর গণপূর্ত বিভাগ', 29, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(76, 'ময়মনসিংহ গণপূর্ত জোন', 61, 8, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(77, 'ময়মনসিংহ গণপূর্ত সার্কেল', 61, 8, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(78, 'ময়মনসিংহ গণপূর্ত বিভাগ', 61, 8, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(79, 'কিশোরগঞ্জ গণপূর্ত বিভাগ', 5, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(80, 'নেত্রকোনা গণপূর্ত বিভাগ', 63, 8, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(81, 'টাঙ্গাইল গণপূর্ত সার্কেল', 3, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(82, 'টাঙ্গাইল গণপূর্ত বিভাগ', 3, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(83, 'জামালপুর গণপূর্ত বিভাগ', 62, 8, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(84, 'শেরপুর গণপূর্ত বিভাগ', 64, 8, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(85, 'গোপালগঞ্জ গণপূর্ত জোন ', 10, 1, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(86, 'গোপালগঞ্জ গণপূর্ত সার্কেল', 10, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(87, 'গোপালগঞ্জ গণপূর্ত বিভাগ', 10, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(88, 'ফরিদপুর গণপূর্ত বিভাগ', 8, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(89, 'রাজবাড়ী গণপূর্ত বিভাগ', 7, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(90, 'মাদারীপুর গণপূর্ত বিভাগ', 9, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(91, 'শরীয়তপুর গণপূর্ত বিভাগ', 13, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(92, 'তত্ত্বাবধায়ক প্রকৌশলী(সংস্থাপন)/(রিজার্ভ)', 0, 0, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(93, 'গণপূর্ত রক্ষণাবেক্ষণ সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(94, 'গণপূর্ত রক্ষণাবেক্ষণ বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(95, 'চট্টগ্রাম গণপূর্ত রক্ষণাবেক্ষণ বিভাগ, চট্টগ্রাম', 22, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(96, 'জনসংখ্যা প্রকল্প কোষ গণপূর্ত সার্কেল (পিপিসি)', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(97, 'জনসংখ্যা প্রকল্প কোষ গণপূর্ত বিভাগ (পিপিসি)', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(98, 'গণপূর্ত প্রকল্প সার্কেল - ১', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(99, 'গণপূর্ত প্রকল্প বিভাগ - ১', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(100, 'গণপূর্ত প্রকল্প বিভাগ - ২', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(101, 'গণপূর্ত প্রকল্প বিভাগ - ৩', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(102, 'গণপূর্ত জরিপ বিভাগ, ঢাকা', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(103, 'গণপূর্ত প্রকল্প সার্কেল - ২, ঢাকা', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(104, 'গণপূর্ত প্রকল্প বিভাগ - ৪', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(105, 'গণপূর্ত প্রকল্প বিভাগ - ৫', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(106, 'গণপূর্ত পেকু সার্কেল, ঢাকা', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(107, 'গণপূর্ত পেকু বিভাগ, ঢাকা', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(108, 'গণপূর্ত মনিটরিং এন্ড অডিট সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(109, 'গণপূর্ত অডিট বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(110, 'গণপূর্ত মনিটরিং বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(111, 'গণপূর্ত ডিজাইন সার্কেল - ১', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(112, 'গণপূর্ত ডিজাইন সার্কেল - ২', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(113, 'গণপূর্ত ডিজাইন বিভাগ - ৬', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(114, 'ঢাকা গণপূর্ত মেট্রোপলিটন জোন ', 1, 1, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(115, 'ঢাকা গণপূর্ত সার্কেল - ১', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(116, 'ঢাকা গণপূর্ত বিভাগ - ১', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(117, 'ঢাকা গণপূর্ত বিভাগ - ২', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(118, 'নগর গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(119, 'আরবরিকালচার গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(120, 'ঢাকা গণপূর্ত সার্কেল - ২', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(121, 'ইডেন ভবন গণপূর্ত বিভাগ, সচিবালয়, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(122, 'ঢাকা গণপূর্ত বিভাগ - ৩', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(123, 'ঢাকা গণপূর্ত বিভাগ - ৪', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(124, 'মেডিকেল কলেজ গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(125, 'ঢাকা গণপূর্ত সার্কেল - ৩', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(126, 'শেরেবাংলা নগর গণপূর্ত বিভাগ - ১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(127, 'শেরেবাংলা নগর গণপূর্ত বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(128, 'শেরেবাংলা নগর গণপূর্ত বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(129, 'মহাখালী গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(130, 'ঢাকা গণপূর্ত জোন, ঢাকা ', 1, 1, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(131, 'ঢাকা গণপূর্ত সার্কেল - ৪, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(132, 'মতিঝিল গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(133, 'আজিমপুর গণপূর্ত বিভাগ, নিউমার্কেট, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(134, 'গণপূর্ত সম্পদ বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(135, 'সাভার গণপূর্ত সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(136, 'সাভার গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(137, 'মিরপুর গণপূর্ত বিভাগ, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(138, 'ঢাকা গণপূর্ত ই/এম জোন', 1, 1, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(139, 'গণপূর্ত ই/এম সার্কেল - ১, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(140, 'গণপূর্ত ই/এম বিভাগ - ১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(141, 'গণপূর্ত ই/এম বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(142, 'গণপূর্ত ই/এম বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(143, 'গণপূর্ত ই/এম সার্কেল - ২, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(144, 'গণপূর্ত ই/এম বিভাগ - ৪, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(145, 'গণপূর্ত ই/এম বিভাগ - ৫, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(146, 'গণপূর্ত ই/এম বিভাগ - ৬, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(147, 'গণপূর্ত ই/এম সার্কেল - ৩, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(148, 'গণপূর্ত ই/এম বিভাগ - ৭, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(149, 'গণপূর্ত ই/এম বিভাগ - ৮, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(150, 'গণপূর্ত ই/এম কারখানা বিভাগ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(151, 'গণপূর্ত কাঠের কারখানা বিভাগ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(152, 'গণপূর্ত ই/এম সার্কেল - ৪, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(153, 'গণপূর্ত ই/এম বিভাগ - ৯, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(154, 'গণপূর্ত ই/এম বিভাগ - ১০, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(155, 'গণপূর্ত ই/এম বিভাগ - ১১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(156, 'গণপূর্ত ই/এম  পিএন্ডডি সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(157, 'গণপূর্ত ই/এম  পিএন্ডডি বিভাগ - ১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(158, 'গণপূর্ত ই/এম  পিএন্ডডি বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(159, 'গণপূর্ত ই/এম  পিএন্ডডি বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(160, 'গণপূর্ত ই/এম প্ল্যানিং সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(161, 'গণপূর্ত ই/এম প্ল্যানিং বিভাগ - ১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(162, 'গণপূর্ত ই/এম প্ল্যানিং বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(163, 'গণপূর্ত ই/এম প্ল্যানিং বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(164, 'গণপূর্ত ই/এম ডিজাইন সার্কেল, ঢাকা ', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(165, 'গণপূর্ত ই/এম ডিজাইন বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(166, 'গণপূর্ত ই/এম ডিজাইন বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(167, 'গণপূর্ত ই/এম এমআইএস বিভাগ - ১, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(168, 'গণপূর্ত ই/এম এমআইএস বিভাগ - ২, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(169, 'গণপূর্ত ই/এম এমআইএস বিভাগ - ৩, ঢাকা ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(170, 'প্রেষণে কর্মরত ', 0, 0, 0, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(171, 'মানিকগঞ্জ গণপূর্ত বিভাগ', 12, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(172, 'গাজীপুর গণপূর্ত বিভাগ', 2, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(173, 'নারায়ণগঞ্জ গণপূর্ত বিভাগ', 4, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(174, 'নরসিংদী গণপূর্ত বিভাগ', 6, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(175, 'মুন্সিগঞ্জ গণপূর্ত বিভাগ', 11, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(177, 'প্রধান প্রকৌশলীর কার্যালয়', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(178, 'অতিরিক্ত প্রধান প্রকৌশলী(সংস্থাপন ও সমন্বয়)', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(179, 'স্বাস্থ্য উইং গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(180, 'অতিরিক্ত প্রধান প্রকৌশলী(পওবিপ্র), গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(181, 'অতিরিক্ত প্রধান প্রকৌশলী (ই/এম), গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(182, 'তত্বাবধায়ক প্রকৌশলী (সংস্থাপন), গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(183, 'তত্বাবধায়ক প্রকৌশলী (সমন্বয়), গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(184, 'তত্ত্বাবধায়ক প্রকৌশলী (উন্নয়ন), গণপূর্ত অধিদপ্তর', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(185, 'ঢাকা গণপূর্ত ই/এম পিএন্ডডি জোন', 1, 1, 2, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(186, 'ঢাকা গণপূর্ত ই/এম এমআইএস সার্কেল', 1, 1, 4, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(187, 'গণপূর্ত ডিজাইন বিভাগ - ১', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(188, 'গণপূর্ত ডিজাইন বিভাগ - ২', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(189, 'গণপূর্ত ডিজাইন বিভাগ - ৩', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(190, 'গণপূর্ত ডিজাইন বিভাগ - ৪', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(191, 'গণপূর্ত ডিজাইন বিভাগ - ৫', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(192, 'ময়মনসিংহ গণপূর্ত ই/এম পিএন্ডডি  বিভাগ', 61, 8, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(193, 'ঢাকা গণপূর্ত ই/এম ডিজাইন বিভাগ - ১', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(194, 'রাঙ্গামাটি গণপূর্ত বিভাগ', 26, 3, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(195, 'খুলনা গণপূর্ত ই/এম পিএন্ডডি বিভাগ', 37, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(196, 'গোপালগঞ্জ গণপূর্ত ই/এম পিএন্ডডি বিভাগ', 10, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(197, 'নড়াইল গণপূর্ত বিভাগ', 41, 5, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(198, 'গাজীপুর গণপূর্ত ই/এম উপ-বিভাগ ', 2, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(199, 'স্থাপত্য অধিদপ্তর (উধ্বর্তন কর্মকর্তা)', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(202, 'নারায়ণগঞ্জ গণপূর্ত ই/এম উপ-বিভাগ ', 4, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(203, 'নরসিংদী গণপূর্ত ই/এম উপ-বিভাগ ', 6, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(204, 'মানিকগঞ্জ গণপূর্ত ই/এম উপ-বিভাগ ', 12, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(205, 'মুন্সীগঞ্জ গণপূর্ত ই/এম উপ-বিভাগ ', 11, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(206, 'বঙ্গভবন গণপূর্ত ই/এম উপ-বিভাগ ', 1, 1, 3, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(207, 'প্রেষণে দুদকে কর্মরত', 1, 1, 1, 0, '2025-06-24 11:54:41', '2025-06-24 11:54:41'),
(211, 'নীলফামারী গণপূর্ত বিভাগ', 60, 11, 3, 1, '2025-07-06 08:35:18', '2025-07-06 08:35:18');

-- --------------------------------------------------------

--
-- Table structure for table `member_zone_types`
--

CREATE TABLE `member_zone_types` (
  `id` int(11) NOT NULL,
  `name` text DEFAULT NULL,
  `priority` int(11) NOT NULL DEFAULT 0,
  `created_by` int(11) DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `member_zone_types`
--

INSERT INTO `member_zone_types` (`id`, `name`, `priority`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 'প্রধান প্রকৌশলীর কার্যালয় ', 1, 0, '2025-06-24 11:51:11', '2025-06-24 11:51:11'),
(2, 'জোন ', 2, 0, '2025-06-24 11:51:11', '2025-06-24 11:51:11'),
(3, 'বিভাগ', 4, 0, '2025-06-24 11:51:11', '2025-06-24 11:51:11'),
(4, 'সার্কেল', 3, 0, '2025-06-24 11:51:11', '2025-06-24 11:51:11');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1),
(4, '2024_08_06_063751_create_personal_access_tokens_table', 2),
(5, '2025_06_25_103456_member_zone_types', 3);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('2B4JYtBfzojXKRCTv03FrHJ19CysWPhBfpJi0zL4', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiZE5QTFRHUG04elpRY2prcXVoTlJoYnJmMHgxNzN3V0JvUEd1V3E2TSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6Mzk6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9hZG1pbi9tZW1iZXJfem9uZSI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==', 1751815912),
('BKN8QOGsXbnac0dgvfuZetS5fcvtOx7h76w0NmFm', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiT2RTUEEyZ3ZJaDEwc2U0ZUFzWGl3eU05ekNkM1FHYjB0NjJxUHRNWCI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MzM6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9hZG1pbi96aWxsYSI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==', 1751804000),
('mbi52sGRORgeUioT1a7Q4UozlwQmyqQYZeea0pJC', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiUjUzUk1IMW42QUNKd1JQMGF4Tk03emd3ZlBKVlM5RFMwUHN5YTluZiI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6Mzk6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9hZG1pbi9tZW1iZXJfem9uZSI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==', 1752119263),
('RM3Earw8Qp4nEEaLOo0dEG2E4uAxSEyUSdfb9fUM', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiRmZsOHc1d29vOXM2UGd1ZnpEV3Fya2ZDRzFQd2JQc1d1UFlIWkM3ZSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MzM6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9hZG1pbi96aWxsYSI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==', 1752129452);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(100) DEFAULT NULL,
  `photo` varchar(100) DEFAULT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `user_type` varchar(50) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `api_secret_key` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `phone`, `photo`, `email_verified_at`, `password`, `user_type`, `remember_token`, `api_secret_key`, `created_at`, `updated_at`) VALUES
(1, 'Rayhanuzzaman', 'admin@gmail.com', '01308389719', 'backend_assets/images/user/668ba2c9734ee.jpg', '2024-04-16 22:43:28', '$2y$12$I72NM9PGVKVVOui0oFZ3P.V5IzV7xHW8V0q/GP3/zPOyTZoUrRx..', 'admin', 'f8EeGJEgPiQnpY4BfbNetRFTMV9npnsnsD1UsPEuLYBXm6KSbFbYOtxrMQO6', '4fd5f6454a0135083a1842eabb945b07ae24d82b', '2024-04-16 22:43:28', '2024-07-08 02:26:49'),
(2, 'operatoruzzaman', 'operator@gmail.com', '01308389719', 'backend_assets/images/user/668ba349538da.jpg', '2024-04-16 22:43:28', '$2y$12$.zhGtTQReAThI08Q33WLT.p1xjVJ2NP7t.RFzG3t/0JMmSngRaAAi', 'operator', 'e1CNHXIvPoKb0xK2q4B9Vj7mKOwyZLlnoBLMOrW9I895wymlE333S3sBhc1N', '4fd5f6454a0135083a1842eabb945b07ae24d82b', '2024-04-16 22:43:28', '2024-07-08 02:28:57');

-- --------------------------------------------------------

--
-- Table structure for table `zillas`
--

CREATE TABLE `zillas` (
  `id` int(11) NOT NULL,
  `division_id` int(11) DEFAULT NULL,
  `name_en` text DEFAULT NULL,
  `name_bn` text DEFAULT NULL,
  `priority` int(11) DEFAULT 0,
  `created_by` int(11) DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `zillas`
--

INSERT INTO `zillas` (`id`, `division_id`, `name_en`, `name_bn`, `priority`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 1, 'Dhaka', 'ঢাকা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:43:45'),
(2, 1, 'Gazipur', 'গাজীপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:46:22'),
(3, 1, 'Tangail', 'টাঙ্গাইল', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:46:45'),
(4, 1, 'Narayanganj', 'নারায়ণগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:47:24'),
(5, 1, 'Kishoreganj', 'কিশোরগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:48:24'),
(6, 1, 'Narsingdi', 'নরসিংদী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:49:07'),
(7, 1, 'Rajbari', 'রাজবাড়ী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:49:16'),
(8, 1, 'Faridpur', 'ফরিদপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:49:49'),
(9, 1, 'Madaripur', 'মাদারীপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:50:34'),
(10, 1, 'Gopalganj', 'গোপালগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:50:11'),
(11, 1, 'Munshiganj', 'মুন্সিগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:51:08'),
(12, 1, 'Manikganj', 'মানিকগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:51:51'),
(13, 1, 'Shariatpur', 'শরীয়তপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:52:33'),
(14, 2, 'Rajshahi', 'রাজশাহী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:52:58'),
(15, 2, 'Sirajganj', 'সিরাজগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:53:18'),
(16, 2, 'Pabna', 'পাবনা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:53:38'),
(17, 2, 'Bogra', 'বগুড়া', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:57:27'),
(18, 2, 'Chapainawabganj', 'চাঁপাইনবাবগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:59:24'),
(19, 2, 'Joypurhat', 'জয়পুরহাট', 0, 1, '2025-07-01 05:37:03', '2025-07-01 16:59:54'),
(20, 2, 'Naogaon', 'নওগাঁ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:00:45'),
(21, 2, 'Natore', 'নাটোর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:01:38'),
(22, 3, 'Chattogram', 'চট্টগ্রাম', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:02:09'),
(23, 3, 'Cumilla', 'কুমিল্লা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:05:04'),
(24, 3, 'Feni', 'ফেনী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:04:52'),
(25, 3, 'Brahmanbaria', 'ব্রাহ্মণবাড়িয়া', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:05:42'),
(26, 3, 'rangamati', 'রাঙ্গামাটি', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:06:15'),
(27, 3, 'Chandpur', 'চাঁদপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:06:50'),
(28, 3, 'Noakhali', 'নোয়াখালী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:07:02'),
(29, 3, 'Lakshmipur', 'লক্ষ্মীপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:07:15'),
(30, 3, 'Coxsbazar', 'কক্সবাজার', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:07:26'),
(31, 3, 'Khagrachhari', 'খাগড়াছড়ি', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:07:43'),
(32, 3, 'Bandarban', 'বান্দরবান', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:08:00'),
(33, 4, 'Sylhet', 'সিলেট', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:08:18'),
(34, 4, 'Moulvibazar', 'মৌলভীবাজার', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:08:30'),
(35, 4, 'Habiganj', 'হবিগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:08:41'),
(36, 4, 'Sunamganj', 'সুনামগঞ্জ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:08:57'),
(37, 5, 'Khulna', 'খুলনা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:09:13'),
(38, 5, 'Jashore', 'যশোর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:09:28'),
(39, 5, 'Satkhira', 'সাতক্ষীরা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:09:44'),
(40, 5, 'Meherpur', 'মেহেরপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:09:54'),
(41, 5, 'Narail', 'নড়াইল', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:10:08'),
(42, 5, 'Chuadanga', 'চুয়াডাঙ্গা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:10:45'),
(43, 5, 'Magura', 'মাগুড়া', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:11:06'),
(44, 5, 'Bagerhat', 'বাগেরহাট', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:11:23'),
(45, 5, 'Jhenaidah', 'ঝিনাইদহ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:11:39'),
(46, 5, 'Kushtia', 'কুষ্টিয়া', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:12:00'),
(47, 6, 'Barishal', 'বরিশাল', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:12:15'),
(48, 6, 'Jhalakathi', 'ঝালকাঠি', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:12:56'),
(49, 6, 'Patuakhali', 'পটুয়াখালী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:13:08'),
(50, 6, 'Pirojpur', 'পিরোজপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:13:25'),
(51, 6, 'Bhola', 'ভোলা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:13:43'),
(52, 6, 'Barguna', 'বরগুনা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:14:30'),
(53, 7, 'Rangpur', 'রংপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:15:03'),
(54, 7, 'Lalmonirhat', 'লালমনিরহাট', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:15:17'),
(55, 7, 'Panchagarh', 'পঞ্চগড়', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:15:31'),
(56, 7, 'Kurigram', 'কুড়িগ্রাম', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:15:45'),
(57, 7, 'Dinajpur', 'দিনাজপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:16:00'),
(58, 7, 'Thakurgaon', 'ঠাকুরগাঁও', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:16:39'),
(59, 7, 'Gaibandha', 'গাইবান্ধা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:16:51'),
(60, 7, 'Nilphamari', 'নীলফামারী', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:17:05'),
(61, 8, 'Mymensingh', 'ময়মনসিংহ', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:17:46'),
(62, 8, 'Jamalpur', 'জামালপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:18:02'),
(63, 8, 'Netrokona', 'নেত্রকোনা', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:18:14'),
(64, 8, 'Sherpur', 'শেরপুর', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:18:23'),
(65, 1, 'Dhaka North City Corporation', 'ঢাকা উত্তর সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:19:11'),
(66, 1, 'Dhaka South City Corporation', 'ঢাকা দক্ষিণ সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:19:32'),
(67, 3, 'Chattogram City Corporation', 'চট্টগ্রাম সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:20:04'),
(68, 3, 'Cumilla City Corporation', 'কুমিল্লা সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:20:34'),
(69, 1, 'Gazipur City Corporation', 'গাজীপুর সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:20:49'),
(70, 5, 'Khulna City Corporation', 'খুলনা সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:21:08'),
(71, 8, 'Mymensingh City Corporation', 'ময়মনসিংহ সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:21:37'),
(72, 1, 'Narayanganj City Corporation', 'নারায়ণগঞ্জ সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:21:54'),
(73, 2, 'Rajshahi City Corporation', 'রাজশাহী সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:22:08'),
(74, 11, 'Rangpur City Corporation', 'রংপুর সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-03 06:02:36'),
(75, 4, 'Sylhet City Corporation', 'সিলেট সিটি কর্পোরেশন', 0, 1, '2025-07-01 05:37:03', '2025-07-01 17:22:42'),
(83, 1, 'Faridpur', 'ফরিদপুর', 1, 1, '2025-07-05 05:59:17', '2025-07-05 06:47:46'),
(84, 2, 'Noakhali', 'নোয়াখালি', 1, 1, '2025-07-05 06:28:38', '2025-07-06 08:37:31'),
(86, 2, 'Noakhali', 'নোয়াখালি2', 1, 1, '2025-07-06 09:38:37', '2025-07-06 09:38:46');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `divisions`
--
ALTER TABLE `divisions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `important_links`
--
ALTER TABLE `important_links`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`),
  ADD KEY `membership_number` (`membership_number`);

--
-- Indexes for table `member_requests`
--
ALTER TABLE `member_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member_zones`
--
ALTER TABLE `member_zones`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member_zone_types`
--
ALTER TABLE `member_zone_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `zillas`
--
ALTER TABLE `zillas`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `divisions`
--
ALTER TABLE `divisions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `important_links`
--
ALTER TABLE `important_links`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `members`
--
ALTER TABLE `members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `member_requests`
--
ALTER TABLE `member_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `member_zones`
--
ALTER TABLE `member_zones`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=213;

--
-- AUTO_INCREMENT for table `member_zone_types`
--
ALTER TABLE `member_zone_types`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `zillas`
--
ALTER TABLE `zillas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
